# EDA with SQL

This notebook executes SQL queries to explore specific facts about the launch record dataset.

### Connect to the database

In [5]:
!pip install sqlalchemy==1.3.9
!pip install ibm_db_sa
!pip install ipython-sql

Requirement already satisfied: sqlalchemy==1.3.9 in c:\users\shanx\anaconda3\lib\site-packages (1.3.9)
Collecting ibm_db_sa
  Downloading ibm_db_sa-0.4.0-py3-none-any.whl.metadata (5.3 kB)
Requirement already satisfied: sqlalchemy>=0.7.3 in c:\users\shanx\anaconda3\lib\site-packages (from ibm_db_sa) (1.3.9)
Collecting ibm-db>=2.0.0 (from ibm_db_sa)
  Downloading ibm_db-3.2.3-cp311-cp311-win_amd64.whl.metadata (1.4 kB)
Downloading ibm_db_sa-0.4.0-py3-none-any.whl (31 kB)
Downloading ibm_db-3.2.3-cp311-cp311-win_amd64.whl (27.8 MB)
   ---------------------------------------- 0.0/27.8 MB ? eta -:--:--
    --------------------------------------- 0.6/27.8 MB 12.4 MB/s eta 0:00:03
   ---- ----------------------------------- 2.8/27.8 MB 30.3 MB/s eta 0:00:01
   ------- -------------------------------- 5.2/27.8 MB 41.5 MB/s eta 0:00:01
   ----------- ---------------------------- 7.8/27.8 MB 41.5 MB/s eta 0:00:01
   -------------- ------------------------- 10.2/27.8 MB 43.4 MB/s eta 0:00:01
   ------------------ --------------------- 12.7/27.8 MB 50.4 MB/s eta 0:00:01
   --------------------- ------------------ 15.1/27.8 MB 50.4 MB/s eta 0:00:01
   ------------------------ --------------- 17.4/27.8 MB 50.4 MB/s eta 0:00:01
   ---------------------------- ----------- 20.0/27.8 MB 50.1 MB/s eta 0:00:01
   -------------------------------- ------- 22.4/27.8 MB 50.4 MB/s eta 0:00:01
   ----------------------------------- ---- 24.4/27.8 MB 46.9 MB/s eta 0:00:01
   ---------------------------------------  27.3/27.8 MB 50.4 MB/s eta 0:00:01
   ---------------------------------------  27.8/27.8 MB 59.5 MB/s eta 0:00:01
   ---------------------------------------  27.8/27.8 MB 59.5 MB/s eta 0:00:01
   ---------------------------------------  27.8/27.8 MB 59.5 MB/s eta 0:00:01
   ---------------------------------------  27.8/27.8 MB 59.5 MB/s eta 0:00:01
   ---------------------------------------  27.8/27.8 MB 59.5 MB/s eta 0:00:01
   ---------------------------------------  27.8/27.8 MB 59.5 MB/s eta 0:00:01
   ---------------------------------------  27.8/27.8 MB 21.1 MB/s eta 0:00:01
   ---------------------------------------  27.8/27.8 MB 21.1 MB/s eta 0:00:01
   ---------------------------------------  27.8/27.8 MB 21.1 MB/s eta 0:00:01
   ---------------------------------------  27.8/27.8 MB 21.1 MB/s eta 0:00:01
   ---------------------------------------  27.8/27.8 MB 21.1 MB/s eta 0:00:01
   ---------------------------------------  27.8/27.8 MB 21.1 MB/s eta 0:00:01
   ---------------------------------------  27.8/27.8 MB 21.1 MB/s eta 0:00:01
   ---------------------------------------  27.8/27.8 MB 21.1 MB/s eta 0:00:01
   ---------------------------------------  27.8/27.8 MB 21.1 MB/s eta 0:00:01
   ---------------------------------------- 27.8/27.8 MB 10.7 MB/s eta 0:00:00
Installing collected packages: ibm-db, ibm_db_sa
Successfully installed ibm-db-3.2.3 ibm_db_sa-0.4.0
Collecting ipython-sql
  Downloading ipython_sql-0.5.0-py3-none-any.whl.metadata (17 kB)
Collecting prettytable (from ipython-sql)
  Downloading prettytable-3.10.0-py3-none-any.whl.metadata (30 kB)
Requirement already satisfied: ipython in c:\users\shanx\anaconda3\lib\site-packages (from ipython-sql) (8.20.0)
Collecting sqlalchemy>=2.0 (from ipython-sql)
  Downloading SQLAlchemy-2.0.30-cp311-cp311-win_amd64.whl.metadata (9.8 kB)
Collecting sqlparse (from ipython-sql)
  Downloading sqlparse-0.5.0-py3-none-any.whl.metadata (3.9 kB)
Requirement already satisfied: six in c:\users\shanx\anaconda3\lib\site-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: ipython-genutils in c:\users\shanx\anaconda3\lib\site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: typing-extensions>=4.6.0 in c:\users\shanx\anaconda3\lib\site-packages (from sqlalchemy>=2.0->ipython-sql) (4.9.0)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\shanx\anaconda3\lib\site-packages (from sqlalchemy>=2.0->ipython-sql) (3.0.1)
Requirement already satisfied: decorator in c:\users\shanx\anaconda3\lib\site-packages (from ipython->ipython-sql) (5.1.1)
Requirement already satisfied: jedi>=0.16 in c:\users\shanx\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.18.1)
Requirement already satisfied: matplotlib-inline in c:\users\shanx\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.1.6)
Requirement already satisfied: prompt-toolkit<3.1.0,>=3.0.41 in c:\users\shanx\anaconda3\lib\site-packages (from ipython->ipython-sql) (3.0.43)
Requirement already satisfied: pygments>=2.4.0 in c:\users\shanx\anaconda3\lib\site-packages (from ipython->ipython-sql) (2.15.1)
Requirement already satisfied: stack-data in c:\users\shanx\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.2.0)
Requirement already satisfied: traitlets>=5 in c:\users\shanx\anaconda3\lib\site-packages (from ipython->ipython-sql) (5.7.1)
Requirement already satisfied: colorama in c:\users\shanx\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.4.6)
Requirement already satisfied: wcwidth in c:\users\shanx\anaconda3\lib\site-packages (from prettytable->ipython-sql) (0.2.5)
Requirement already satisfied: parso<0.9.0,>=0.8.0 in c:\users\shanx\anaconda3\lib\site-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.3)
Requirement already satisfied: executing in c:\users\shanx\anaconda3\lib\site-packages (from stack-data->ipython->ipython-sql) (0.8.3)
Requirement already satisfied: asttokens in c:\users\shanx\anaconda3\lib\site-packages (from stack-data->ipython->ipython-sql) (2.0.5)
Requirement already satisfied: pure-eval in c:\users\shanx\anaconda3\lib\site-packages (from stack-data->ipython->ipython-sql) (0.2.2)
Downloading ipython_sql-0.5.0-py3-none-any.whl (20 kB)
Downloading SQLAlchemy-2.0.30-cp311-cp311-win_amd64.whl (2.1 MB)
   ---------------------------------------- 0.0/2.1 MB ? eta -:--:--
   ----------- ---------------------------- 0.6/2.1 MB 18.5 MB/s eta 0:00:01
   ---------------------------------------  2.1/2.1 MB 26.4 MB/s eta 0:00:01
   ---------------------------------------- 2.1/2.1 MB 19.0 MB/s eta 0:00:00
Downloading prettytable-3.10.0-py3-none-any.whl (28 kB)
Downloading sqlparse-0.5.0-py3-none-any.whl (43 kB)
   ---------------------------------------- 0.0/44.0 kB ? eta -:--:--
   ---------------------------------------- 44.0/44.0 kB 1.1 MB/s eta 0:00:00
Installing collected packages: sqlparse, sqlalchemy, prettytable, ipython-sql
  Attempting uninstall: sqlalchemy
    Found existing installation: SQLAlchemy 1.3.9
    Uninstalling SQLAlchemy-1.3.9:
      Successfully uninstalled SQLAlchemy-1.3.9
Successfully installed ipython-sql-0.5.0 prettytable-3.10.0 sqlalchemy-2.0.30 sqlparse-0.5.0

**<span style="color:blueviolet;">First load the SQL extension and establish a connection with the database**

In [7]:
%load_ext sql

*About possible error due to wrong virtual environment [discussion](https://stackoverflow.com/questions/37149748/ipython-notebook-and-sql-importerror-no-module-named-sql-when-running-load).

In [13]:
import csv, sqlite3

con = sqlite3.connect("my_data1.db")
cur = con.cursor()

In [31]:
#!pip install -q pandas==2.2.2

**<span style="color:blueviolet;">Connect to magic sql using SQLite:**

In [19]:
%sql sqlite:///my_data1.db

**<span style="color:blueviolet;">Write dataframe into a SQL database:**

In [21]:
import pandas as pd

# read in dataset
df = pd.read_csv("https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBM-DS0321EN-SkillsNetwork/labs/module_2/data/Spacex.csv")

In [25]:
df.shape

(101, 10)

In [27]:
df.to_sql("SPACEXTBL", con, if_exists='replace', index=False,method="multi")

101

**<span style="color:blueviolet;">Remove blank rows from table:**

In [29]:
%sql create table SPACEXTABLE as select * from SPACEXTBL where Date is not null

 * sqlite:///my_data1.db
Done.

[]

### First look of the dataset

In [37]:
#Retrieve and print all columns, without and with SQLiteMagic

statement = '''SELECT * FROM SPACEXTABLE limit 5'''
cur.execute(statement)
all = cur.fetchall()

for row in all:
    print(row)

('2010-06-04', '18:45:00', 'F9 v1.0  B0003', 'CCAFS LC-40', 'Dragon Spacecraft Qualification Unit', 0, 'LEO', 'SpaceX', 'Success', 'Failure (parachute)')
('2010-12-08', '15:43:00', 'F9 v1.0  B0004', 'CCAFS LC-40', 'Dragon demo flight C1, two CubeSats, barrel of Brouere cheese', 0, 'LEO (ISS)', 'NASA (COTS) NRO', 'Success', 'Failure (parachute)')
('2012-05-22', '7:44:00', 'F9 v1.0  B0005', 'CCAFS LC-40', 'Dragon demo flight C2', 525, 'LEO (ISS)', 'NASA (COTS)', 'Success', 'No attempt')
('2012-10-08', '0:35:00', 'F9 v1.0  B0006', 'CCAFS LC-40', 'SpaceX CRS-1', 500, 'LEO (ISS)', 'NASA (CRS)', 'Success', 'No attempt')
('2013-03-01', '15:10:00', 'F9 v1.0  B0007', 'CCAFS LC-40', 'SpaceX CRS-2', 677, 'LEO (ISS)', 'NASA (CRS)', 'Success', 'No attempt')

In [39]:
%sql SELECT * FROM SPACEXTABLE limit 5;

 * sqlite:///my_data1.db
Done.

[('2010-06-04', '18:45:00', 'F9 v1.0  B0003', 'CCAFS LC-40', 'Dragon Spacecraft Qualification Unit', 0, 'LEO', 'SpaceX', 'Success', 'Failure (parachute)'),
 ('2010-12-08', '15:43:00', 'F9 v1.0  B0004', 'CCAFS LC-40', 'Dragon demo flight C1, two CubeSats, barrel of Brouere cheese', 0, 'LEO (ISS)', 'NASA (COTS) NRO', 'Success', 'Failure (parachute)'),
 ('2012-05-22', '7:44:00', 'F9 v1.0  B0005', 'CCAFS LC-40', 'Dragon demo flight C2', 525, 'LEO (ISS)', 'NASA (COTS)', 'Success', 'No attempt'),
 ('2012-10-08', '0:35:00', 'F9 v1.0  B0006', 'CCAFS LC-40', 'SpaceX CRS-1', 500, 'LEO (ISS)', 'NASA (CRS)', 'Success', 'No attempt'),
 ('2013-03-01', '15:10:00', 'F9 v1.0  B0007', 'CCAFS LC-40', 'SpaceX CRS-2', 677, 'LEO (ISS)', 'NASA (CRS)', 'Success', 'No attempt')]

In [41]:
## number of rows in the dataset
%sql SELECT COUNT(*) FROM SPACEXTABLE;

 * sqlite:///my_data1.db
Done.

[(101,)]

### Explore Specific Features

Note: If the column names are in mixed case enclose it in double quotes
--- For Example "Landing_Outcome"

##### <span style="color:limegreen;">**Display the names of the unique launch sites  in the space mission**

In [48]:
%sql SELECT DISTINCT Launch_Site FROM SPACEXTABLE;

 * sqlite:///my_data1.db
Done.

[('CCAFS LC-40',), ('VAFB SLC-4E',), ('KSC LC-39A',), ('CCAFS SLC-40',)]

##### <span style="color:limegreen;">**Display 5 records where launch sites begin with the string 'CCA'**

In [51]:
%sql SELECT * FROM SPACEXTABLE WHERE Launch_Site LIKE 'CCA%' LIMIT 5;

 * sqlite:///my_data1.db
Done.

[('2010-06-04', '18:45:00', 'F9 v1.0  B0003', 'CCAFS LC-40', 'Dragon Spacecraft Qualification Unit', 0, 'LEO', 'SpaceX', 'Success', 'Failure (parachute)'),
 ('2010-12-08', '15:43:00', 'F9 v1.0  B0004', 'CCAFS LC-40', 'Dragon demo flight C1, two CubeSats, barrel of Brouere cheese', 0, 'LEO (ISS)', 'NASA (COTS) NRO', 'Success', 'Failure (parachute)'),
 ('2012-05-22', '7:44:00', 'F9 v1.0  B0005', 'CCAFS LC-40', 'Dragon demo flight C2', 525, 'LEO (ISS)', 'NASA (COTS)', 'Success', 'No attempt'),
 ('2012-10-08', '0:35:00', 'F9 v1.0  B0006', 'CCAFS LC-40', 'SpaceX CRS-1', 500, 'LEO (ISS)', 'NASA (CRS)', 'Success', 'No attempt'),
 ('2013-03-01', '15:10:00', 'F9 v1.0  B0007', 'CCAFS LC-40', 'SpaceX CRS-2', 677, 'LEO (ISS)', 'NASA (CRS)', 'Success', 'No attempt')]

##### <span style="color:limegreen;">**Display the total payload mass carried by boosters launched by NASA (CRS)**

In [54]:
%sql SELECT SUM(PAYLOAD_MASS__KG_) FROM SPACEXTABLE WHERE Customer = 'NASA (CRS)';

 * sqlite:///my_data1.db
Done.

[(45596,)]

##### <span style="color:limegreen;">**Display average payload mass carried by booster version F9 v1.1**

In [57]:
%sql SELECT AVG(PAYLOAD_MASS__KG_) FROM SPACEXTABLE WHERE Booster_Version = 'F9 v1.1';

 * sqlite:///my_data1.db
Done.

[(2928.4,)]

##### <span style="color:limegreen;">**List the date when the first succesful landing outcome in ground pad was acheived.**

In [60]:
%sql SELECT MIN(Date) FROM SPACEXTABLE WHERE Landing_Outcome = 'Success (ground pad)';

 * sqlite:///my_data1.db
Done.

[('2015-12-22',)]

##### <span style="color:limegreen;">**List the names of the boosters which have success in drone ship and have payload mass greater than 4000 but less than 6000**

In [63]:
%sql SELECT Booster_Version FROM SPACEXTABLE WHERE (PAYLOAD_MASS__KG_ BETWEEN 4000 AND 6000) \
AND Landing_Outcome = 'Success (drone ship)';

 * sqlite:///my_data1.db
Done.

[('F9 FT B1022',), ('F9 FT B1026',), ('F9 FT  B1021.2',), ('F9 FT  B1031.2',)]

##### <span style="color:limegreen;">**List the total number of successful and failure mission outcomes**

In [14]:
%%sql SELECT Mission_Outcome, COUNT(Mission_Outcome) as total
FROM SPACEXTABLE
GROUP BY Mission_Outcome;

 * sqlite:///my_data1.db
Done.

[('Failure (in flight)', 1),
 ('Success', 98),
 ('Success ', 1),
 ('Success (payload status unclear)', 1)]

In [67]:
%%sql SELECT COUNT(*) FROM SPACEXTABLE
WHERE Mission_Outcome LIKE 'sUCCESS%';

 * sqlite:///my_data1.db
Done.

[(100,)]

In [69]:
%%sql SELECT COUNT(*) FROM SPACEXTABLE
WHERE Mission_Outcome LIKE 'failure%';

 * sqlite:///my_data1.db
Done.

[(1,)]

##### <span style="color:limegreen;">**List the names of the booster_versions which have carried the maximum payload mass.**

In [72]:
%%sql SELECT Booster_Version FROM SPACEXTABLE
WHERE PAYLOAD_MASS__KG_ = (SELECT MAX(PAYLOAD_MASS__KG_) FROM SPACEXTABLE);

 * sqlite:///my_data1.db
Done.

[('F9 B5 B1048.4',),
 ('F9 B5 B1049.4',),
 ('F9 B5 B1051.3',),
 ('F9 B5 B1056.4',),
 ('F9 B5 B1048.5',),
 ('F9 B5 B1051.4',),
 ('F9 B5 B1049.5',),
 ('F9 B5 B1060.2 ',),
 ('F9 B5 B1058.3 ',),
 ('F9 B5 B1051.6',),
 ('F9 B5 B1060.3',),
 ('F9 B5 B1049.7 ',)]

In [74]:
%%sql SELECT Booster_Version, PAYLOAD_MASS__KG_ FROM SPACEXTABLE
WHERE PAYLOAD_MASS__KG_ = (SELECT MAX(PAYLOAD_MASS__KG_) FROM SPACEXTABLE);

 * sqlite:///my_data1.db
Done.

[('F9 B5 B1048.4', 15600),
 ('F9 B5 B1049.4', 15600),
 ('F9 B5 B1051.3', 15600),
 ('F9 B5 B1056.4', 15600),
 ('F9 B5 B1048.5', 15600),
 ('F9 B5 B1051.4', 15600),
 ('F9 B5 B1049.5', 15600),
 ('F9 B5 B1060.2 ', 15600),
 ('F9 B5 B1058.3 ', 15600),
 ('F9 B5 B1051.6', 15600),
 ('F9 B5 B1060.3', 15600),
 ('F9 B5 B1049.7 ', 15600)]

##### <span style="color:limegreen;">**List the records which will display the month names, failure landing_outcomes in drone ship ,booster versions, launch_site for the months in year 2015.**

In [77]:
%%sql 
SELECT SUBSTR(Date,6,2) as Month, Landing_Outcome, Booster_Version, Launch_Site, Date
FROM SPACEXTABLE
WHERE SUBSTR(Date,1,4) = '2015' AND Landing_Outcome = 'Failure (drone ship)';

 * sqlite:///my_data1.db
Done.

[('01', 'Failure (drone ship)', 'F9 v1.1 B1012', 'CCAFS LC-40', '2015-01-10'),
 ('04', 'Failure (drone ship)', 'F9 v1.1 B1015', 'CCAFS LC-40', '2015-04-14')]

Note: SQLLite does not support monthnames. So need to use substr(Date, 4, 2) as month to get the months and substr(Date,7,4)='2015' for year.

##### <span style="color:limegreen;">**Rank the count of landing outcomes (such as Failure (drone ship) or Success (ground pad)) between the date 2010-06-04 and 2017-03-20, in descending order.**

In [82]:
%%sql
SELECT Landing_Outcome, COUNT(Landing_Outcome) as Count
FROM SPACEXTABLE
WHERE Date BETWEEN '2010-06-04' AND '2017-03-20'
GROUP BY Landing_Outcome
ORDER BY Count DESC;

 * sqlite:///my_data1.db
Done.

[('No attempt', 10),
 ('Success (drone ship)', 5),
 ('Failure (drone ship)', 5),
 ('Success (ground pad)', 3),
 ('Controlled (ocean)', 3),
 ('Uncontrolled (ocean)', 2),
 ('Failure (parachute)', 2),
 ('Precluded (drone ship)', 1)]